# Taps
tap 'cantino/mcfly'
tap 'cyberark/tools'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'romkatv/powerlevel10k'

brew 'age'
brew 'bind'
brew 'coreutils'
brew 'git-delta'
brew 'fzf'
brew 'go'
brew 'gopass'
brew 'gpg'
brew 'jq'
brew 'loc'
brew 'pgcli'
brew 'pinentry-mac'
brew 'pyenv'
brew 'rename'
brew 'ripgrep'
brew 'summon'
brew 'svn'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'xsv'

# Git
brew 'bfg'
brew 'git'
brew 'hub'

# Dotfile Management
brew 'chezmoi'
brew 'powerlevel10k'

# Benchmarking / Diagnostic
brew 'hyperfine'
brew 'pv'

# https://github.com/sindresorhus/quick-look-plugins
cask 'apparency'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

cask 'aws-vault'
cask 'betterzip'
cask 'postico'
cask 'visual-studio-code'

# Fonts
cask 'font-meslo-for-powerline'
cask 'font-meslo-lg-nerd-font'
cask 'font-meslo-lg-dz'
cask 'font-meslo-lg'
