# Taps
# https://github.com/cyberark/secretless-broker/pull/1456
tap 'anchore/syft'
tap 'hashicorp/tap'
tap 'romkatv/powerlevel10k'

# Languages
brew 'chruby'
brew 'go'
brew 'pyenv'
brew 'ruby'
brew 'ruby-install'
brew 'rust'
brew 'rustup-init'
brew 'nvm'

# Compression/Archiving
brew 'bzip2' 
brew 'gnu-tar' 
brew 'xz'
cask 'betterzip'

# DB
brew 'mysql-client'
brew 'pgcli'
brew 'postgresql@16'
cask 'postico'

# General
brew 'act'
brew 'bazelisk'
brew 'bind'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'dnsmasq'
brew 'duti'
brew 'enchant'
brew 'gdbm'
brew 'gnu-getopt' 
brew 'gnutls' 
brew 'less'
brew 'libyaml'
# https://github.com/FiloSottile/mkcert
brew 'mkcert'
brew 'nss'
brew 'openssl@3' 
brew 'readline' 
brew 'rename'
brew 'syft'
brew 'watch'
brew 'wget'
cask 'moom'

# Infra
brew 'arkade'
brew 'eksctl'
brew 'k3sup'
brew 'kubernetes-cli'
brew 'nixpacks'
brew 'terragrunt'
brew 'tfenv'
cask 'tailscale'

# Wrangling/Navigation
brew 'findutils' 
brew 'fzf'
brew 'gawk' 
brew 'gnu-sed' 
brew 'grep'
brew 'jq'
brew 'loc'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tree'
brew 'xsv'
brew 'yamllint'

# Secret Management, Encryption, etc.
brew 'age'
brew 'gpg'
brew 'pinentry-mac'
cask 'gpg-suite'
cask '1password-cli'

# VCS
brew 'bfg'
brew 'git'
brew 'gh'
brew 'git-delta'
# https://github.com/cli/cli/blob/trunk/docs/gh-vs-hub.md
brew 'hub'
brew 'svn'

# Dotfile Management
brew 'chezmoi'
brew 'powerlevel10k'

# Benchmarking / Diagnostic
brew 'hyperfine'
brew 'pv'

# Cloud
brew 'azure-cli'
brew 'aws-nuke'

# LLM
brew 'ollama'
cask 'claude-code'

# Quicklook Plugins
# https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Terminal, IDE
brew 'tmux'
brew 'vim'
cask 'iterm2'
cask 'visual-studio-code'
cask 'cursor'

# Fonts
cask 'font-meslo-for-powerline'
cask 'font-meslo-lg'
cask 'font-meslo-lg-dz'
cask 'font-meslo-lg-nerd-font'
